app/controllers/proyects_controller.rb

  def index

    if params[:category_id]
      @category = Category.find params[:category_id]
      @proyects = @category.proyects
    else if params[:user_id]
      @user = User.find params[:user_id]
      @proyects = @user.proyects
    else
      @proyects = Proyect.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "proyects".* FROM "proyects"

  def create
    @proyect = Proyect.new(proyect_params)

    respond_to do |format|
      if @proyect.save
---
INSERT INTO "proyects" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hola"], ["user_id", 1], ["created_at", "2018-05-06 02:05:22.174851"], ["updated_at", "2018-05-06 02:05:22.174851"]]

    def set_proyect
      @proyect = Proyect.find(params[:id])
---
SELECT  "proyects".* FROM "proyects" WHERE "proyects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]