app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "jajajja"], ["encrypted_password", "$2a$11$UqgKvg53FH4pudiw4WnPtuZf3IUzOBBn0TlaWOiFlslZL1z0s2eaC"], ["updated_at", "2018-05-24 03:24:10.826637"], ["id", 9]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]